mock-example/src/test/resources/xml/FinRep/SrvUpdateRating/rq1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
			   xmlns:fin="http://sbrf.ru/NCP/ASFO/GetFinAnalysisRq/"
			   xmlns:asfo="http://sbrf.ru/NCP/ASFO/">
	<soap:Header/>
	<soap:Body>
		<asfo:updateRatingRq xmlns:asfo="http://sbrf.ru/NCP/ASFO/" xmlns:upd="http://sbrf.ru/NCP/ASFO/UpdateRatingRq/">
			<upd:rating>
				<upd:ratingId>string</upd:ratingId>
				<!--Optional:-->
				<upd:finalRatingValue>3</upd:finalRatingValue>
				<!--Optional:-->
				<upd:intermediateRatingValue>3</upd:intermediateRatingValue>
				<!--Optional:-->
				<upd:ajustedRatingValue>3</upd:ajustedRatingValue>
				<!--Optional:-->
				<upd:pd>1000.00</upd:pd>
				<upd:status>string</upd:status>
				<!--Optional:-->
				<upd:approvalDate>2008-09-29T05:49:45</upd:approvalDate>
				<!--Optional:-->
				<upd:calculationDate>2014-09-19T03:18:33</upd:calculationDate>
				<!--Optional:-->
				<upd:ajustmentDate>2006-08-19T21:27:14+04:00</upd:ajustmentDate>
				<upd:modelName>string</upd:modelName>
				<upd:modelIntegrationId>string</upd:modelIntegrationId>
				<upd:ratingName>string</upd:ratingName>
				<upd:ratingType>string</upd:ratingType>
				<upd:employeeForApprove>
					<upd:login>string</upd:login>
					<upd:lastName>string</upd:lastName>
					<upd:firstName>string</upd:firstName>
					<!--Optional:-->
					<upd:middleName>string</upd:middleName>
					<upd:division>string</upd:division>
					<upd:divisionCode>string</upd:divisionCode>
					<!--Optional:-->
					<upd:jobTitle>string</upd:jobTitle>
					<upd:role>string</upd:role>
				</upd:employeeForApprove>
				<upd:listOfRatingCalc>
					<!--1 or more repetitions:-->
					<upd:ratingCalc>
						<upd:ratingCalcId>string</upd:ratingCalcId>
						<upd:modelName>string</upd:modelName>
						<upd:modelIntegrationId>string</upd:modelIntegrationId>
						<!--Optional:-->
						<upd:dateCalc>2009-05-16T16:42:28</upd:dateCalc>
						<!--Optional:-->
						<upd:calcValue>3</upd:calcValue>
						<!--Optional:-->
						<upd:listOfRatingAjustment>
							<!--Zero or more repetitions:-->
							<upd:ratingAjustment>
								<upd:ajustmentDate>2003-08-09T04:18:37+04:00</upd:ajustmentDate>
								<upd:ajustedValue>3</upd:ajustedValue>
								<upd:ajustmetReason>string</upd:ajustmetReason>
								<!--Optional:-->
								<upd:comments>string</upd:comments>
								<upd:status>string</upd:status>
								<upd:employeeForAjustment>
									<upd:login>string</upd:login>
									<upd:lastName>string</upd:lastName>
									<upd:firstName>string</upd:firstName>
									<!--Optional:-->
									<upd:middleName>string</upd:middleName>
									<upd:division>string</upd:division>
									<upd:divisionCode>string</upd:divisionCode>
									<!--Optional:-->
									<upd:jobTitle>string</upd:jobTitle>
									<upd:role>string</upd:role>
								</upd:employeeForAjustment>
							</upd:ratingAjustment>
						</upd:listOfRatingAjustment>
						<!--Optional:-->
						<upd:employeeForCalc>
							<upd:login>string</upd:login>
							<upd:lastName>string</upd:lastName>
							<upd:firstName>string</upd:firstName>
							<!--Optional:-->
							<upd:middleName>string</upd:middleName>
							<upd:division>string</upd:division>
							<upd:divisionCode>string</upd:divisionCode>
							<!--Optional:-->
							<upd:jobTitle>string</upd:jobTitle>
							<upd:role>string</upd:role>
						</upd:employeeForCalc>
						<!--Optional:-->
						<upd:listOfResultRating>
							<!--Zero or more repetitions:-->
							<upd:resultRating>
								<upd:isPrimary>false</upd:isPrimary>
								<upd:name>string</upd:name>
								<upd:value>3</upd:value>
								<!--Optional:-->
								<upd:type>string</upd:type>
							</upd:resultRating>
						</upd:listOfResultRating>
						<!--Optional:-->
						<upd:listOfCalculatedFactor>
							<!--Zero or more repetitions:-->
							<upd:calculatedFactor>
								<upd:code>string</upd:code>
								<upd:name>string</upd:name>
								<upd:value>string</upd:value>
							</upd:calculatedFactor>
						</upd:listOfCalculatedFactor>
					</upd:ratingCalc>
				</upd:listOfRatingCalc>
			</upd:rating>
		</asfo:updateRatingRq>
	</soap:Body>
</soap:Envelope>